
special_char_dict = {'㌃': 'あーる', '…': 'てん', '∩': 'きごう', '〓': 'きごう', '＝': 'けいさん', '∫': 'きごう', '↑': 'やじるし', '\\': 'えん', '￥': 'たんい', '∪': 'きごう', '♂': 'きごう', '〃': 'どう', '仝': 'きごう', 'ゞ': 'きごう', 'ゝ': 'きごう', 'ヾ': 'きごう',
  'ヽ': 'きごう', '々': 'どう', '♪': 'きごう', '∠': 'きごう', '×': 'ばつ', '【': 'かっこひらき', '】': 'かっことじ', '『': 'かっこひらき', '』': 'かっことじ', '《': 'かっこひらき', '》': 'かっことじ', '「': 'かっこひらき', '」': 'かっことじ', '〈': 'かっこひらき', '〉': 'かっことじ',
  '｛': 'かっこひらき', '｝': 'かっことじ', '［': 'かっこひらき', '］': 'かっことじ', '（': 'かっこひらき', '）': 'かっことじ', '≪': 'かっこひらき', '≫': 'かっことじ', '｢': 'かっこひらき', '｣': 'かっことじ', '{': 'かっこひらき', '}': 'かっことじ', '[': 'かっこひらき', ']': 'かっことじ',
  '<': 'かっこひらき', '>': 'かっことじ', '(': 'かっこひらき', ')': 'かっことじ', '〔': 'かっこひらき', '〕': 'かっことじ', '㈱': 'かぶしきがいしゃ', '㏍': 'かぶしきがいしゃ', '～': 'より', '㌍': 'かろりー', '，': 'てん', '〆': 'しめ', '―': 'きごう', '‐': 'きごう',  '“': 'きごう',
  '"': 'きごう', '／': 'しゃせん', '〇': 'まる', '＿': 'きごう', '￣': 'きごう', '¨': 'てん', '｀': 'てん', '´': 'てん', '゜': 'はんだくてん', '゛': 'てん', '＼': 'しゃせん', '§': 'せくしょん', '＾': 'きごう', '≫': 'きごう', '￢': 'きごう', '⇒': 'きごう', '⇔': 'きごう', '∀': 'きごう',
  '∃': 'きごう', '⊥': 'すいちょく', '⌒': 'きごう', '∂': 'きごう', '∇': 'きごう', '≡': 'ごうどう', '∨': 'きごう', '≪': 'きごう', '†': 'だがー', '√': 'るーと', '∽': 'きごう', '∝': 'きごう', '∵': 'なぜならば', '∬': 'きごう', 'Å': 'たんい', '‰': 'たんい', '♯': 'しゃーぷ', '♭': 'ふらっと',
  '‡': 'きごう', '′': 'ふん', '≒': 'きんじ', '∥': 'たてぼう', '∧': 'きごう', '｜': 'たてぼう', '±': 'ぷらすまいなす', '÷': 'わる', '≠': 'ふとうごう', '≦': 'ふとうごう', '≧': 'ふとうごう', '∞': 'むげんだい', '∴': 'ゆえに', '♀': 'めす', '‥': 'きごう', '°': 'ど', '⊃': 'きごう',
  '⊂': 'きごう','⊇': 'きごう', '⊆': 'きごう', '∋': 'きごう', '∈': 'きごう', '〒': 'ゆうびんばんごう', '※': 'ほし', '″': 'びょう', '㌔': 'きろ', '㎏': 'きろぐらむ', '㎞': 'きろめーとる', '㌘': 'ぐらむ', '★': 'ほし', '●': 'ずけい', '㊦': 'した', '－': 'まいなす', '＋': 'ぷらす',
  '＜': 'だいなり', '＞': 'しょうなり', '▲': 'ずけい', '▽': 'ずけい', '△': 'ずけい', '▼': 'ずけい', '⊿': 'さんかくけい', 'cc': 'しーしー', '◇': 'ひし', '◆': 'ひし', '□': 'ずけい', '■': 'ずけい', '↓': 'やじるし', '㍼': 'しょうわ', '㊤': 'じょう', '☆': 'ほし', '○': 'まる', '◎': 'まる',
  '℃': 'ど', '㎝': 'せんちめーとる', '㌢': 'せんち', '￠㌣': 'せんと', '㍽': 'たいしょう', '㈹': 'だいひょう', '￠': 'たんい', '￡': 'たんい', '％': 'ぱーせんと', '＄': 'たんい', '㊥': 'ちゅう', '∟': 'ちょっかく', '；': 'てん', '：': 'てん', '．': 'まる', '、': 'てん', '.': 'てん',
  '・': 'てん', '･': 'てん', ':': 'てん', ';': 'てん', 'ﾞ': 'てん', 'ﾟ': 'てん', '℡': 'でんわ', '㌧': 'とん', '№': 'なんばー', '%': 'ぱーせんと', '㌫': 'ぱーせんと', '㊧': 'ひだり', '←': 'やじるし', '∮': 'ふぁい', '㍻': 'へいせい', '㎡': 'へいほうめーとる', '㌶': 'へくたーる',
  '㌻': 'ぺいじ', '｡': 'まる', '。●': 'まる', '→': 'やじるし', '㊨': 'みぎ', '㎜': 'みりめーとる', '㍉': 'みり', '㎎': 'みりぐらむ', '㍊': 'みりばーる', '㍍': 'めーとる', '㍾': 'めいじ', '㈲': 'ゆうげんがいしゃ', '㍑': 'りっとる', '㍗': 'わっと' }
